# Программа последовательного поиска элемента в списке 
# Первое задание: поиск всех элементов в списке
# Второе задание: поиск первого элемента в списке (раскомментировать 21 строку)

# Исходный список расположен в файле input.txt 
fileArray = open("input.txt", "r")
arr = []
for lineArray in fileArray :
    arr.append(int(lineArray))

# Число, которое необходимо ввести для поиска
digit = int(input("Введите число от 1 до 10: "))

num = 0

for i in range(len(arr)) :
    if arr[i] == digit :
        # Выводит в консоль индекс заданного числа
        print("Есть под номером ", i)
        num += 1
        #break

# Вывод в консоль если число не найдено
if (num == 0) :
    print("Число не найдено")        

    
